IdeaRS.OpenModel.Message.OpenMessage
Open message base class

IdeaRS.OpenModel.Message.OpenMessage.#ctor
Constructor

IdeaRS.OpenModel.Message.OpenMessage.#ctor(IdeaRS.OpenModel.Message.MessageNumber,IdeaRS.OpenModel.OpenObject,System.String,System.String,IdeaRS.OpenModel.Message.OpenMessage)
Constructor
number: Number of the message
description: Description of the message
openObject: Affected object
propertyName: Affected property
innerMessage: Inner message

IdeaRS.OpenModel.Message.OpenMessage.Create(IdeaRS.OpenModel.Message.MessageNumber,IdeaRS.OpenModel.OpenObject,System.String,System.String,IdeaRS.OpenModel.Message.OpenMessage)
Creating message
number: Number of the message
description: Description of the message
openObject: Affected object
propertyName: Affected property
innerMessage: Inner message
Returns: The created message or null if the number is not supported

IdeaRS.OpenModel.Message.OpenMessage.Number
Number of message

IdeaRS.OpenModel.Message.OpenMessage.InnerMessage
Inner message

IdeaRS.OpenModel.Message.OpenMessage.Description
Description of message

IdeaRS.OpenModel.Message.OpenMessage.Object
Affected object

IdeaRS.OpenModel.Message.OpenMessage.PropertyName
Affected property name

IdeaRS.OpenModel.Message.OpenMessage.PropertyValue
Gets the value of affected property

IdeaRS.OpenModel.Message.OpenMessage.Message
Gets the Message